Revit 2027 API
ExternalServices.BuiltInExternalServices.PipeFittingAndAccessoryPressureDropService Property
 The external service which permits registration of an alternate implementation for pipe fitting and accessory pressure drop calculation. To use this service, programmers implement a server class that derives from IPipeFittingAndAccessoryPressureDropServer.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId PipeFittingAndAccessoryPressureDropService { get; }
Public Shared ReadOnly Property PipeFittingAndAccessoryPressureDropService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ PipeFittingAndAccessoryPressureDropService {
	ExternalServiceId^ get ();
}
static member PipeFittingAndAccessoryPressureDropService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace